grblHAL/STM32F4xx/Src/driver.c
#if defined(SAFETY_DOOR_PIN)
static pin_debounce_t debounce;
#endif
static void aux_irq_handler (uint8_t port, bool state);

#if defined(I2C_STROBE_PIN) || SPI_IRQ_BIT

#if defined(I2C_STROBE_PIN)
static driver_irq_handler_t i2c_strobe = { .type = IRQ_I2C_Strobe };
#endif

#if SPI_IRQ_BIT
static driver_irq_handler_t spi_irq = { .type = IRQ_SPI };
#endif

static bool irq_claim (irq_type_t irq, uint_fast8_t id, irq_callback_ptr handler)
{
    bool ok = false;

    switch(irq) {

#if defined(I2C_STROBE_PIN)
        case IRQ_I2C_Strobe:
            if((ok = i2c_strobe.callback == NULL))
                i2c_strobe.callback = handler;
            break;
#endif

#if SPI_IRQ_BIT
        case IRQ_SPI:
            if((ok = spi_irq.callback == NULL))
                spi_irq.callback = handler;
            break;
#endif

        default:
            break;
    }

    return ok;
}

#endif // defined(I2C_STROBE_PIN) || SPI_IRQ_BIT

#include "grbl/stepdir_map.h"

#ifdef SQUARING_ENABLED
static axes_signals_t motors_1 = {AXES_BITMASK}, motors_2 = {AXES_BITMASK};
#endif

static void driver_delay (uint32_t ms, delay_callback_ptr callback)
{
    if((delay.ms = ms) > 0) {
        if(!(delay.callback = callback)) {
            while(delay.ms)
                grbl.on_execute_delay(state_get());
        }
    } else {
        delay.callback = NULL;
        if(callback)
            callback();
    }
}

// Enable/disable stepper motors
static void stepperEnable (axes_signals_t enable, bool hold)
{
#if !TRINAMIC_MOTOR_ENABLE
    enable.mask ^= settings.steppers.enable_invert.mask;
  #ifdef STEPPERS_ENABLE_PIN
    DIGITAL_OUT(STEPPERS_ENABLE_PORT, STEPPERS_ENABLE_PIN, enable.x);
  #endif
  #ifdef X_ENABLE_PIN
    DIGITAL_OUT(X_ENABLE_PORT, X_ENABLE_PIN, enable.x);
  #endif
  #ifdef X2_ENABLE_PIN
    DIGITAL_OUT(X2_ENABLE_PORT, X2_ENABLE_PIN, enable.x);
  #endif
  #ifdef Y_ENABLE_PIN
    DIGITAL_OUT(Y_ENABLE_PORT, Y_ENABLE_PIN, enable.y);
  #endif
  #ifdef Y2_ENABLE_PIN
    DIGITAL_OUT(Y2_ENABLE_PORT, Y2_ENABLE_PIN, enable.y);
  #endif
  #ifdef Z_ENABLE_PIN
    DIGITAL_OUT(Z_ENABLE_PORT, Z_ENABLE_PIN, enable.z);
  #endif
  #ifdef Z2_ENABLE_PIN
    DIGITAL_OUT(Z2_ENABLE_PORT, Z2_ENABLE_PIN, enable.z);
  #endif
  #ifdef A_ENABLE_PORT
    DIGITAL_OUT(A_ENABLE_PORT, A_ENABLE_PIN, enable.a);
  #endif
  #ifdef B_ENABLE_PORT
    DIGITAL_OUT(B_ENABLE_PORT, B_ENABLE_PIN, enable.b);
  #endif
  #ifdef C_ENABLE_PORT
    DIGITAL_OUT(C_ENABLE_PORT, C_ENABLE_PIN, enable.c);
  #endif
  #ifdef U_ENABLE_PORT
    DIGITAL_OUT(U_ENABLE_PORT, U_ENABLE_PIN, enable.u);
  #endif
  #ifdef V_ENABLE_PORT
    DIGITAL_OUT(V_ENABLE_PORT, V_ENABLE_PIN, enable.v);
  #endif
  #ifdef W_ENABLE_PORT
    DIGITAL_OUT(W_ENABLE_PORT, W_ENABLE_PIN, enable.w);
  #endif
#endif
}

// Starts stepper driver ISR timer and forces a stepper driver interrupt callback
static void stepperWakeUp (void)
{
    hal.stepper.enable((axes_signals_t){AXES_BITMASK}, false);

    STEPPER_TIMER->ARR = hal.f_step_timer / 500; // ~2ms delay to allow drivers time to wake up.
    STEPPER_TIMER->EGR = TIM_EGR_UG;
    STEPPER_TIMER->SR = 0;
    STEPPER_TIMER->DIER = TIM_DIER_UIE;
    STEPPER_TIMER->CR1 |= TIM_CR1_CEN;
}

// Sets up stepper driver interrupt timeout, "Normal" version
ISR_CODE static void stepperCyclesPerTick (uint32_t cycles_per_tick)
{
    STEPPER_TIMER->ARR = cycles_per_tick < (1UL << 20) ? max(cycles_per_tick, step_pulse.t_min_period) : 0x000FFFFFUL;
}

// Set stepper pulse output pins
// NOTE: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z...
#ifdef SQUARING_ENABLED

inline static __attribute__((always_inline)) void stepper_step_out (axes_signals_t step_out1)
{
    axes_signals_t step_out2;

#if STEP_INJECT_ENABLE

    axes_signals_t axes = { .bits = step_pulse.inject.axes.bits };

    if(axes.bits) {

        step_out2.bits = step_out1.bits & motors_2.bits;
        step_out1.bits = step_out1.bits & motors_1.bits;

        uint_fast8_t idx, mask = 1;
        axes_signals_t step1 = { .bits = step_out1.bits },
                       step2 = { .bits = step_out2.bits };

        step_out1.bits ^= settings.steppers.step_invert.bits;
        step_out2.bits ^= settings.steppers.step_invert.bits;

        for(idx = 0; idx < N_AXIS; idx++) {

            if(!(axes.bits & mask)) {

                if(step2.bits & mask) switch(idx) {
#ifdef X2_STEP_PIN
                    case X_AXIS:
                        DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out2.x);
                        break;
#endif
#ifdef Y2_STEP_PIN
                    case Y_AXIS:
                        DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out2.y);
                        break;
#endif
#ifdef Z2_STEP_PIN
                    case Z_AXIS:
                        DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out2.z);
                        break;
#endif
                }

                if(step1.bits & mask) switch(idx) {

                    case X_AXIS:
                        DIGITAL_OUT(X_STEP_PORT, X_STEP_PIN, step_out1.x);
                        break;

                    case Y_AXIS:
                        DIGITAL_OUT(Y_STEP_PORT, Y_STEP_PIN, step_out1.y);
                        break;

                    case Z_AXIS:
                        DIGITAL_OUT(Z_STEP_PORT, Z_STEP_PIN, step_out1.z);
                        break;
#ifdef A_AXIS
                    case A_AXIS:
                        DIGITAL_OUT(A_STEP_PORT, A_STEP_PIN, step_out1.a);
                        break;
#endif
#ifdef B_AXIS
                    case B_AXIS:
                        DIGITAL_OUT(B_STEP_PORT, B_STEP_PIN, step_out1.b);
                        break;
#endif
#ifdef C_AXIS
                    case C_AXIS:
                        DIGITAL_OUT(C_STEP_PORT, C_STEP_PIN, step_out1.c);
                        break;
#endif
#ifdef U_AXIS
                    case U_AXIS:
                        DIGITAL_OUT(U_STEP_PORT, U_STEP_PIN, step_out1.u);
                        break;
#endif
#ifdef V_AXIS
                    case V_AXIS:
                        DIGITAL_OUT(V_STEP_PORT, V_STEP_PIN, step_out1.v);
                        break;
#endif
#ifdef W_AXIS
                    case W_AXIS:
                        DIGITAL_OUT(W_STEP_PORT, W_STEP_PIN, step_out1.w);
                        break;
#endif
                }
            }
            mask <<= 1;
        }
    } else {

#endif // STEP_INJECT_ENABLE

