grblHAL/STM32F4xx/Src/driver.c
    step_out2.bits = (step_out1.bits & motors_2.bits) ^ settings.steppers.step_invert.bits;

#if STEP_OUTMODE == GPIO_BITBAND
    step_out1.bits = (step_out1.bits & motors_1.bits) ^ settings.steppers.step_invert.bits;

    DIGITAL_OUT(X_STEP_PORT, X_STEP_PIN, step_out1.x);
 #ifdef X2_STEP_PIN
    DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out2.x);
 #endif
    DIGITAL_OUT(Y_STEP_PORT, Y_STEP_PIN, step_out1.y);
 #ifdef Y2_STEP_PIN
    DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out2.y);
 #endif
    DIGITAL_OUT(Z_STEP_PORT, Z_STEP_PIN, step_out1.z);
 #ifdef Z2_STEP_PIN
    DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out2.z);
 #endif
 #ifdef A_AXIS
    DIGITAL_OUT(A_STEP_PORT, A_STEP_PIN, step_out1.a);
 #endif
 #ifdef B_AXIS
    DIGITAL_OUT(B_STEP_PORT, B_STEP_PIN, step_out1.b);
 #endif
 #ifdef C_AXIS
    DIGITAL_OUT(C_STEP_PORT, C_STEP_PIN, step_out1.c);
 #endif
 #ifdef U_AXIS
   	DIGITAL_OUT(U_STEP_PORT, U_STEP_PIN, step_out1.u);
 #endif
 #ifdef V_AXIS
   	DIGITAL_OUT(V_STEP_PORT, V_STEP_PIN, step_out1.v);
 #endif
 #ifdef W_AXIS
   	DIGITAL_OUT(W_STEP_PORT, W_STEP_PIN, step_out1.w);
 #endif

#elif STEP_OUTMODE == GPIO_MAP
    STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | step_outmap[step_out1.value & motors_1.bits];
 #ifdef X2_STEP_PIN
    DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out2.x);
 #endif
 #ifdef Y2_STEP_PIN
    DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out2.y);
 #endif
 #ifdef Z2_STEP_PIN
    DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out2.z);
 #endif

#else // STEP_OUTMODE == GPIO_SHIFTx
    STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | (((step_out1.bits & motors_1.bits) ^ settings.steppers.step_invert.bits) << STEP_OUTMODE);
 #ifdef X2_STEP_PIN
    DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out2.x);
 #endif
 #ifdef Y2_STEP_PIN
    DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out2.y);
 #endif
 #ifdef Z2_STEP_PIN
    DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out2.z);
 #endif
#endif
#if STEP_INJECT_ENABLE
    }
#endif
}

// Enable/disable motors for auto squaring of ganged axes
static void StepperDisableMotors (axes_signals_t axes, squaring_mode_t mode)
{
    motors_1.mask = (mode == SquaringMode_A || mode == SquaringMode_Both ? axes.mask : 0) ^ AXES_BITMASK;
    motors_2.mask = (mode == SquaringMode_B || mode == SquaringMode_Both ? axes.mask : 0) ^ AXES_BITMASK;
}

#else // SQUARING DISABLED

inline static __attribute__((always_inline)) void stepper_step_out (axes_signals_t step_out)
{
#if STEP_INJECT_ENABLE

    axes_signals_t axes = { .bits = step_pulse.inject.axes.bits };

    if(axes.bits) {

        uint_fast8_t idx, mask = 1;

        step_out.bits ^= settings.steppers.step_invert.bits;

        for(idx = 0; idx < N_AXIS; idx++) {

            if(!(axes.bits & mask)) switch(idx) {

                case X_AXIS:
                    DIGITAL_OUT(X_STEP_PORT, X_STEP_PIN, step_out.x);
                    break;

                case Y_AXIS:
                    DIGITAL_OUT(Y_STEP_PORT, Y_STEP_PIN, step_out.y);
                    break;

                case Z_AXIS:
                    DIGITAL_OUT(Z_STEP_PORT, Z_STEP_PIN, step_out.z);
                    break;
#ifdef A_AXIS
                case A_AXIS:
                    DIGITAL_OUT(A_STEP_PORT, A_STEP_PIN, step_out.a);
                    break;
#endif
#ifdef B_AXIS
                case B_AXIS:
                    DIGITAL_OUT(B_STEP_PORT, B_STEP_PIN, step_out.b);
                    break;
#endif
#ifdef C_AXIS
                case C_AXIS:
                    DIGITAL_OUT(C_STEP_PORT, C_STEP_PIN, step_out.c);
                    break;
#endif
#ifdef U_AXIS
                case U_AXIS:
                    DIGITAL_OUT(U_STEP_PORT, U_STEP_PIN, step_out.u);
                    break;
#endif
#ifdef V_AXIS
                case V_AXIS:
                    DIGITAL_OUT(V_STEP_PORT, V_STEP_PIN, step_out.v);
                    break;
#endif
#ifdef W_AXIS
                case W_AXIS:
                    DIGITAL_OUT(W_STEP_PORT, W_STEP_PIN, step_out.w);
                    break;
#endif
            }
            mask <<= 1;
        }
    } else {

#endif // STEP_INJECT_ENABLE

#if STEP_OUTMODE == GPIO_BITBAND
    step_out.bits ^= settings.steppers.step_invert.bits;
    DIGITAL_OUT(X_STEP_PORT, X_STEP_PIN, step_out.x);
  #ifdef X2_STEP_PIN
    DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out.x);
  #endif
    DIGITAL_OUT(Y_STEP_PORT, Y_STEP_PIN, step_out.y);
  #ifdef Y2_STEP_PIN
    DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out.y);
  #endif
    DIGITAL_OUT(Z_STEP_PORT, Z_STEP_PIN, step_out.z);
  #ifdef Z2_STEP_PIN
    DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out.z);
  #endif
  #ifdef A_AXIS
    DIGITAL_OUT(A_STEP_PORT, A_STEP_PIN, step_out.a);
  #endif
  #ifdef B_AXIS
    DIGITAL_OUT(B_STEP_PORT, B_STEP_PIN, step_out.b);
  #endif
  #ifdef C_AXIS
    DIGITAL_OUT(C_STEP_PORT, C_STEP_PIN, step_out.c);
  #endif
  #ifdef U_AXIS
    DIGITAL_OUT(U_STEP_PORT, U_STEP_PIN, step_out.u);
  #endif
  #ifdef V_AXIS
    DIGITAL_OUT(V_STEP_PORT, V_STEP_PIN, step_out.v);
  #endif
  #ifdef W_AXIS
    DIGITAL_OUT(W_STEP_PORT, W_STEP_PIN, step_out.w);
  #endif
#elif STEP_OUTMODE == GPIO_MAP
    STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | step_outmap[step_out.value];
  #ifdef X2_STEP_PIN
    DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out.x ^ settings.steppers.step_invert.x);
  #endif
  #ifdef Y2_STEP_PIN
    DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out.y ^ settings.steppers.step_invert.y);
  #endif
  #ifdef Z2_STEP_PIN
    DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out.z ^ settings.steppers.step_invert.z);
  #endif
#else // STEP_OUTMODE == GPIO_SHIFTx
 #if N_GANGED
   step_out.bits ^= settings.steppers.step_invert.bits;
   STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | (step_out.bits << STEP_OUTMODE);
  #ifdef X2_STEP_PIN
   DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out.x);
  #endif
  #ifdef Y2_PIN
   DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out.y);
  #endif
  #ifdef Z2_STEP_PIN
   DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out.z);
  #endif
 #else
   STEP_PORT->ODR = (STEP_PORT->ODR & ~STEP_MASK) | ((step_out.bits << STEP_OUTMODE) ^ settings.steppers.step_invert.bits);
 #endif
#endif
#if STEP_INJECT_ENABLE
    }
#endif
}

#endif

#ifdef GANGING_ENABLED

static axes_signals_t getGangedAxes (bool auto_squared)
{
    axes_signals_t ganged = {0};

