grblHAL/STM32F4xx/Src/driver.c
// Start a stepper pulse, delay version.
// Note: delay is only added when there is a direction change and a pulse to be output.
ISR_CODE static void stepperPulseStartDelayed (stepper_t *stepper)
{
    if(stepper->dir_changed.bits) {

        stepper_dir_out(stepper->dir_out);

        if(stepper->step_out.bits) {

            if(stepper->step_out.bits & stepper->dir_changed.bits) {

                step_pulse.out = stepper->step_out; // Store out_bits

                if(STEPPER_TIMER->CNT < step_pulse.t_dly_off_min) {
                    STEPPER_TIMER->CNT = step_pulse.t_dly_off_min;
                    NVIC_ClearPendingIRQ(STEPPER_TIMER_IRQn);
                }

                STEPPER_TIMER->CCR2 = STEPPER_TIMER->CNT - step_pulse.t_on;

                STEPPER_TIMER->SR = 0;
                STEPPER_TIMER->DIER |= TIM_DIER_CC2IE;

            } else
                _stepper_step_out(stepper->step_out);
        }

        stepper->dir_changed.bits = 0;

        return;
    }

    if(stepper->step_out.bits)
        _stepper_step_out(stepper->step_out);
}

#if STEP_INJECT_ENABLE

static inline __attribute__((always_inline)) void inject_step (axes_signals_t step_out, axes_signals_t axes)
{
    uint_fast8_t idx = N_AXIS - 1;

    if(!step_out.bits)
        step_pulse.inject.axes.bits = step_pulse.inject.claimed.bits;

    step_out.bits ^= settings.steppers.step_invert.bits;

    do {
        if(axes.bits & (1 << (N_AXIS - 1))) {

            switch(idx) {

                case X_AXIS:
                    DIGITAL_OUT(X_STEP_PORT, X_STEP_PIN, step_out.x);
#ifdef X2_STEP_PIN
                    DIGITAL_OUT(X2_STEP_PORT, X2_STEP_PIN, step_out.x);
#endif
                    break;

                case Y_AXIS:
                    DIGITAL_OUT(Y_STEP_PORT, Y_STEP_PIN, step_out.y);
#ifdef Y2_STEP_PIN
                    DIGITAL_OUT(Y2_STEP_PORT, Y2_STEP_PIN, step_out.y);
#endif
                    break;

                case Z_AXIS:
                    DIGITAL_OUT(Z_STEP_PORT, Z_STEP_PIN, step_out.z);
#ifdef Z2_STEP_PIN
                    DIGITAL_OUT(Z2_STEP_PORT, Z2_STEP_PIN, step_out.z);
#endif
                    break;
#ifdef A_AXIS
                case A_AXIS:
                    DIGITAL_OUT(A_STEP_PORT, A_STEP_PIN, step_out.a);
                    break;
#endif
#ifdef B_AXIS
                case B_AXIS:
                    DIGITAL_OUT(B_STEP_PORT, B_STEP_PIN, step_out.b);
                    break;
#endif
#ifdef C_AXIS
                case C_AXIS:
                    DIGITAL_OUT(C_STEP_PORT, C_STEP_PIN, step_out.c);
                    break;
#endif
#ifdef U_AXIS
                case U_AXIS:
                    DIGITAL_OUT(U_STEP_PORT, U_STEP_PIN, step_out.u);
                    break;
#endif
#ifdef V_AXIS
                case V_AXIS:
                    DIGITAL_OUT(V_STEP_PORT, V_STEP_PIN, step_out.v);
                    break;
#endif
#ifdef W_AXIS
                case W_AXIS:
                    DIGITAL_OUT(W_STEP_PORT, W_STEP_PIN, step_out.w);
                    break;
#endif
            }
        }
        idx--;
        axes.bits <<= 1;
    } while(axes.bits & AXES_BITMASK);
}

static void stepperClaimMotor (uint_fast8_t axis_id, bool claim)
{
    if(claim)
        step_pulse.inject.claimed.mask |= ((1 << axis_id) & AXES_BITMASK);
    else {
        step_pulse.inject.claimed.mask &= ~(1 << axis_id);
        step_pulse.inject.axes.bits = step_pulse.inject.claimed.bits;
    }
}

ISR_CODE void stepperOutputStep (axes_signals_t step_out, axes_signals_t dir_out)
{
    if(step_out.bits) {

        uint_fast8_t idx = N_AXIS - 1;
        axes_signals_t axes = { .bits = (step_out.bits & AXES_BITMASK) };

        step_pulse.inject.out = step_out;
        step_pulse.inject.axes.bits = step_pulse.inject.claimed.bits | step_out.bits;
        dir_out.bits ^= settings.steppers.dir_invert.bits;

        do {
            if(axes.bits & (1 << (N_AXIS - 1))) {

                switch(idx) {

                    case X_AXIS:
                        DIGITAL_OUT(X_DIRECTION_PORT, X_DIRECTION_PIN, dir_out.x);
#ifdef X2_DIRECTION_PIN
                        DIGITAL_OUT(X2_DIRECTION_PORT, X2_DIRECTION_PIN, dir_out.x ^ settings.steppers.ganged_dir_invert.x);
#endif
                        break;

                    case Y_AXIS:
                        DIGITAL_OUT(Y_DIRECTION_PORT, Y_DIRECTION_PIN, dir_out.y);
#ifdef Y2_DIRECTION_PIN
                        DIGITAL_OUT(Y2_DIRECTION_PORT, Y2_DIRECTION_PIN, dir_out.y ^ settings.steppers.ganged_dir_invert.y);
#endif
                        break;

                    case Z_AXIS:
                        DIGITAL_OUT(Z_DIRECTION_PORT, Z_DIRECTION_PIN, dir_out.z);
#ifdef Z2_DIRECTION_PIN
                        DIGITAL_OUT(Z2_DIRECTION_PORT, Z2_DIRECTION_PIN, dir_out.z ^ settings.steppers.ganged_dir_invert.z);
#endif
                        break;
#ifdef A_AXIS
                    case A_AXIS:
                        DIGITAL_OUT(A_DIRECTION_PORT, A_DIRECTION_PIN, dir_out.a);
                        break;
#endif
#ifdef B_AXIS
                    case B_AXIS:
                        DIGITAL_OUT(B_DIRECTION_PORT, B_DIRECTION_PIN, dir_out.b);
                        break;
#endif
#ifdef C_AXIS
                    case C_AXIS:
                        DIGITAL_OUT(C_DIRECTION_PORT, C_DIRECTION_PIN, dir_out.c);
                        break;
#endif
#ifdef U_AXIS
                    case U_AXIS:
                        DIGITAL_OUT(U_DIRECTION_PORT, U_DIRECTION_PIN, dir_out.u);
                        break;
#endif
#ifdef V_AXIS
                    case V_AXIS:
                        DIGITAL_OUT(V_DIRECTION_PORT, V_DIRECTION_PIN, dir_out.v);
                        break;
#endif
#ifdef W_AXIS
                    case W_AXIS:
                        DIGITAL_OUT(W_DIRECTION_PORT, W_DIRECTION_PIN, dir_out.w);
                        break;
#endif
                }
            }
            idx--;
            axes.bits <<= 1;
        } while(axes.bits & AXES_BITMASK);

        if(step_pulse.delay == 0)
            inject_step(step_out, step_out);

