grblHAL/STM32F4xx/Src/driver.c
        hal.timer.start(step_pulse.inject.timer, step_pulse.length);
    }
}

void step_inject_on (void *context)
{
    inject_step(step_pulse.inject.out, step_pulse.inject.out);
}

void step_inject_off (void *context)
{
    axes_signals_t axes = { .bits = step_pulse.inject.out.bits };

    step_pulse.inject.out.bits = 0;
    step_pulse.inject.axes.bits = step_pulse.inject.claimed.bits;

    inject_step((axes_signals_t){0}, axes);
}

#endif // STEP_INJECT_ENABLE

// Enable/disable limit pins interrupt
static void limitsEnable (bool on, axes_signals_t homing_cycle)
{
    bool disable = !on;
    axes_signals_t pin;
    input_signal_t *limit;
    uint_fast8_t idx = limit_inputs.n_pins;
    limit_signals_t homing_source = xbar_get_homing_source_from_cycle(homing_cycle);

    while(idx--) {
        limit = &limit_inputs.pins.inputs[idx];
        if(on && homing_cycle.mask) {
            pin = xbar_fn_to_axismask(limit->id);
            disable = limit->group == PinGroup_Limit ? (pin.mask & homing_source.min.mask) : (pin.mask & homing_source.max.mask);
        }
#ifdef Z_LIMIT_POLL
        if(limit->id != Input_LimitZ)
#endif
        gpio_irq_enable(limit, disable ? IRQ_Mode_None : limit->mode.irq_mode);
    };

#ifdef Z_LIMIT_POLL
    z_limits_irq_enabled = on && !homing_cycle.z;
#endif
}

// Returns limit state as an limit_signals_t variable.
// Each bitfield bit indicates an axis limit, where triggered is 1 and not triggered is 0.
inline static limit_signals_t limitsGetState (void)
{
    limit_signals_t signals = {0};

    signals.min.mask = settings.limits.invert.mask;
#ifdef DUAL_LIMIT_SWITCHES
    signals.min2.mask = settings.limits.invert.mask;
#endif
#ifdef MAX_LIMIT_SWITCHES
    signals.max.mask = settings.limits.invert.mask;
#endif

#if LIMIT_INMODE == GPIO_BITBAND
    signals.min.x = DIGITAL_IN(X_LIMIT_PORT, X_LIMIT_PIN);
    signals.min.y = DIGITAL_IN(Y_LIMIT_PORT, Y_LIMIT_PIN);
    signals.min.z = DIGITAL_IN(Z_LIMIT_PORT, Z_LIMIT_PIN);
  #ifdef A_LIMIT_PIN
    signals.min.a = DIGITAL_IN(A_LIMIT_PORT, A_LIMIT_PIN);
  #endif
  #ifdef B_LIMIT_PIN
    signals.min.b = DIGITAL_IN(B_LIMIT_PORT, B_LIMIT_PIN);
  #endif
  #ifdef C_LIMIT_PIN
    signals.min.c = DIGITAL_IN(C_LIMIT_PORT, C_LIMIT_PIN);
  #endif
  #ifdef U_LIMIT_PIN
    signals.min.u = DIGITAL_IN(U_LIMIT_PORT, U_LIMIT_PIN);
  #endif
  #ifdef V_LIMIT_PIN
    signals.min.v = DIGITAL_IN(V_LIMIT_PORT, V_LIMIT_PIN);
  #endif
  #ifdef W_LIMIT_PIN
    signals.min.w = DIGITAL_IN(W_LIMIT_PORT, W_LIMIT_PIN);
  #endif
#elif LIMIT_INMODE == GPIO_MAP
    uint32_t bits = LIMIT_PORT->IDR;
    signals.min.x = !!(bits & X_LIMIT_BIT);
    signals.min.y = !!(bits & Y_LIMIT_BIT);
    signals.min.z = !!(bits & Z_LIMIT_BIT);
  #ifdef A_LIMIT_PIN
    signals.min.a = !!(bits & A_LIMIT_BIT);
  #endif
  #ifdef B_LIMIT_PIN
    signals.min.b = !!(bits & B_LIMIT_BIT);
  #endif
  #ifdef C_LIMIT_PIN
    signals.min.c = !!(bits & C_LIMIT_BIT);
  #endif
  #ifdef U_LIMIT_PIN
    signals.min.u = !!(bits & U_LIMIT_BIT);
  #endif
  #ifdef V_LIMIT_PIN
    signals.min.v = !!(bits & V_LIMIT_BIT);
  #endif
  #ifdef W_LIMIT_PIN
    signals.min.w = !!(bits & W_LIMIT_BIT);
  #endif
#else
    signals.min.value = (uint8_t)((LIMIT_PORT->IDR & LIMIT_MASK) >> LIMIT_INMODE);
#endif

#ifdef X2_LIMIT_PIN
    signals.min2.x = DIGITAL_IN(X2_LIMIT_PORT, X2_LIMIT_PIN);
#endif
#ifdef Y2_LIMIT_PIN
    signals.min2.y = DIGITAL_IN(Y2_LIMIT_PORT, Y2_LIMIT_PIN);
#endif
#ifdef Z2_LIMIT_PIN
    signals.min2.z = DIGITAL_IN(Z2_LIMIT_PORT, Z2_LIMIT_PIN);
#endif

#ifdef X_LIMIT_PIN_MAX
    signals.max.x = DIGITAL_IN(X_LIMIT_PORT_MAX, X_LIMIT_PIN_MAX);
#endif
#ifdef Y_LIMIT_PIN_MAX
    signals.max.y = DIGITAL_IN(Y_LIMIT_PORT_MAX, Y_LIMIT_PIN_MAX);
#endif
#ifdef Z_LIMIT_PIN_MAX
    signals.max.z = DIGITAL_IN(Z_LIMIT_PORT_MAX, Z_LIMIT_PIN_MAX);
#endif
#ifdef A_LIMIT_PIN_MAX
    signals.max.a = DIGITAL_IN(A_LIMIT_PORT_MAX, A_LIMIT_PIN_MAX);
#endif
#ifdef B_LIMIT_PIN_MAX
    signals.max.b = DIGITAL_IN(B_LIMIT_PORT_MAX, B_LIMIT_PIN_MAX);
#endif
#ifdef C_LIMIT_PIN_MAX
    signals.max.c = DIGITAL_IN(C_LIMIT_PORT_MAX, C_LIMIT_PIN_MAX);
#endif
#ifdef U_LIMIT_PIN_MAX
    signals.max.u = DIGITAL_IN(U_LIMIT_PORT_MAX, U_LIMIT_PIN_MAX);
#endif
#ifdef V_LIMIT_PIN_MAX
    signals.max.v = DIGITAL_IN(V_LIMIT_PORT_MAX, V_LIMIT_PIN_MAX);
#endif
#ifdef V_LIMIT_PIN_MAX
    signals.max.w = DIGITAL_IN(W_LIMIT_PORT_MAX, W_LIMIT_PIN_MAX);
#endif

    if (settings.limits.invert.mask) {
        signals.min.value ^= settings.limits.invert.mask;
#ifdef DUAL_LIMIT_SWITCHES
        signals.min2.mask ^= settings.limits.invert.mask;
#endif
#ifdef MAX_LIMIT_SWITCHES
        signals.max.value ^= settings.limits.invert.mask;
#endif
    }

    return signals;
}

#if HOME_MASK

// Returns home state as an home_signals_t variable.
// Each bitfield bit indicates an axis limit, where triggered is 1 and not triggered is 0.
inline static home_signals_t homeGetState (void)
{
    home_signals_t signals = {0};

    signals.a.mask = settings.home_invert.mask;
#ifdef DUAL_HOME_SWITCHES
    signals.a.mask = settings.home_invert.mask;
#endif

#if HOME_INMODE == GPIO_BITBAND
    signals.a.x = DIGITAL_IN(X_HOME_PORT, X_HOME_PIN);
    signals.a.y = DIGITAL_IN(Y_HOME_PORT, Y_HOME_PIN);
    signals.a.z = DIGITAL_IN(Z_HOME_PORT, Z_HOME_PIN);
  #ifdef A_HOME_PIN
    signals.a.a = DIGITAL_IN(A_HOME_PORT, A_HOME_PIN);
  #endif
  #ifdef B_HOME_PIN
    signals.a.b = DIGITAL_IN(B_HOME_PORT, B_HOME_PIN);
  #endif
  #ifdef C_HOME_PIN
    signals.a.c = DIGITAL_IN(C_HOME_PORT, C_HOME_PIN);
  #endif
  #ifdef U_HOME_PIN
     signals.a.u = DIGITAL_IN(U_HOME_PORT, U_HOME_PIN);
  #endif
  #ifdef V_HOME_PIN
    signals.a.v = DIGITAL_IN(V_HOME_PORT, V_HOME_PIN);
  #endif
  #ifdef W_HOME_PIN
    signals.a.w = DIGITAL_IN(W_HOME_PORT, W_HOME_PIN);
  #endif
#elif HOME_INMODE == GPIO_MAP
    uint32_t bits = HOME_PORT->IDR;
    signals.a.x = !!(bits & X_HOME_BIT);
    signals.a.y = !!(bits & Y_HOME_BIT);
    signals.a.z = !!(bits & Z_HOME_BIT);
  #ifdef A_HOME_PIN
    signals.a.a = !!(bits & A_HOME_BIT);
  #endif
  #ifdef B_HOME_PIN
    signals.a.b = !!(bits & B_HOME_BIT);
  #endif
  #ifdef C_HOME_PIN
    signals.a.c = !!(bits & C_HOME_BIT);
  #endif
  #ifdef U_HOME_PIN
    signals.a.u = !!(bits & U_HOME_BIT);
  #endif
  #ifdef V_HOME_PIN
      signals.a.v = !!(bits & V_HOME_BIT);
  #endif
  #ifdef W_HOME_PIN
    signals.a.w = !!(bits & W_HOME_BIT);
  #endif
#else
    signals.a.value = (uint8_t)((HOME_PORT->IDR & HOME_MASK) >> HOME_INMODE);
#endif

#ifdef X2_HOME_PIN
    signals.b.x = DIGITAL_IN(X2_HOME_PORT, X2_HOME_PIN);
#endif
#ifdef Y2_HOME_PIN
    signals.b.y = DIGITAL_IN(Y2_HOME_PORT, Y2_HOME_PIN);
#endif
#ifdef Z2_HOME_PIN
    signals.b.z = DIGITAL_IN(Z2_HOME_PORT, Z2_HOME_PIN);
#endif

    if (settings.limits.invert.mask) {
        signals.a.value ^= settings.home_invert.mask;
#ifdef DUAL_HOME_SWITCHES
        signals.b.value ^= settings.home_invert.mask;
#endif
    }

    return signals;
}

#endif // HOME_MASK

// Returns system state as a control_signals_t variable.
// Each bitfield bit indicates a control signal, where triggered is 1 and not triggered is 0.
static control_signals_t systemGetState (void)
{
    control_signals_t signals = { settings.control_invert.mask };

#if defined(RESET_PIN) && !ESTOP_ENABLE
    signals.reset = DIGITAL_IN(RESET_PORT, RESET_PIN);
#endif
#if defined(RESET_PIN) && ESTOP_ENABLE
    signals.e_stop = DIGITAL_IN(RESET_PORT, RESET_PIN);
#endif
#ifdef FEED_HOLD_PIN
    signals.feed_hold = DIGITAL_IN(FEED_HOLD_PORT, FEED_HOLD_PIN);
#endif
#ifdef CYCLE_START_PIN
    signals.cycle_start = DIGITAL_IN(CYCLE_START_PORT, CYCLE_START_PIN);
#endif
#ifdef SAFETY_DOOR_PIN
    if(debounce.safety_door)
        signals.safety_door_ajar = !settings.control_invert.safety_door_ajar;
    else
        signals.safety_door_ajar = DIGITAL_IN(SAFETY_DOOR_PORT, SAFETY_DOOR_PIN);;
#endif
#ifdef MOTOR_FAULT_PIN
    signals.motor_fault = DIGITAL_IN(MOTOR_FAULT_PORT, MOTOR_FAULT_PIN);
#endif
#ifdef MOTOR_WARNING_PIN
    signals.motor_warning = DIGITAL_IN(MOTOR_WARNING_PORT, MOTOR_WARNING_PIN);
#endif

    if(settings.control_invert.mask)
        signals.value ^= settings.control_invert.mask;

    return aux_ctrl_scan_status(signals);
}

#if DRIVER_PROBES

