grblHAL/STM32F4xx/Src/driver.c
                case Input_LimitX:
                case Input_LimitX_2:
                case Input_LimitX_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.x ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.x ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;

                case Input_LimitY:
                case Input_LimitY_2:
                case Input_LimitY_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.y ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.y ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;

                case Input_LimitZ:
                case Input_LimitZ_2:
                case Input_LimitZ_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.z ? PullMode_None : PullMode_Up;
#ifdef Z_LIMIT_POLL
                    if(input->id != Input_LimitZ)
#endif
                    input->mode.irq_mode = limit_fei.z ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#ifdef A_AXIS
                case Input_LimitA:
                case Input_LimitA_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.a ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.a ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#endif
#ifdef B_AXIS
                case Input_LimitB:
                case Input_LimitB_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.b ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.b ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#endif
#ifdef C_AXIS
                case Input_LimitC:
                case Input_LimitC_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.c ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.c ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#endif
#ifdef U_AXIS
                case Input_LimitU:
                case Input_LimitU_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.u ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.u ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#endif
#ifdef V_AXIS
                case Input_LimitV:
                case Input_LimitV_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.v ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.v ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#endif
#ifdef W_AXIS
                case Input_LimitW:
                case Input_LimitW_Max:
                    input->mode.pull_mode = settings->limits.disable_pullup.w ? PullMode_None : PullMode_Up;
                    input->mode.irq_mode = limit_fei.w ? IRQ_Mode_Falling : IRQ_Mode_Rising;
                    break;
#endif
#if HOME_MASK
                case Input_HomeX:
                case Input_HomeX_2:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.x ? PullMode_None : PullMode_Up;
                    break;

                case Input_HomeY:
                case Input_HomeY_2:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.y ? PullMode_None : PullMode_Up;
                    break;

                case Input_HomeZ:
                case Input_HomeZ_2:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.z ? PullMode_None : PullMode_Up;
                    break;
#ifdef A_AXIS
                case Input_HomeA:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.a ? PullMode_None : PullMode_Up;
                    break;
#endif
#ifdef B_AXIS
                case Input_HomeB:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.b ? PullMode_None : PullMode_Up;
                    break;
#endif
#ifdef C_AXIS
                case Input_HomeC:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.c ? PullMode_None : PullMode_Up;
                    break;
#endif
#ifdef U_AXIS
                case Input_HomeU:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.u ? PullMode_None : PullMode_Up;
                    break;
#endif
#ifdef V_AXIS
                case Input_HomeV:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.v ? PullMode_None : PullMode_Up;
                    break;
#endif
#ifdef W_AXIS
                case Input_HomeW:
                    input->mode.pull_mode = PullMode_Up; // settings->limits.disable_pullup.w ? PullMode_None : PullMode_Up;
                    break;
#endif
#endif // HOME_MASK
                case Input_SPIIRQ:
                    input->mode.pull_mode = true;
                    input->mode.irq_mode = IRQ_Mode_Falling;
                    break;

                case Input_SpindleIndex:
                    input->mode.pull_mode = true;
                    input->mode.irq_mode = IRQ_Mode_Falling;
                    break;

#if SDCARD_ENABLE && defined(SD_DETECT_PIN)
                case Input_SdCardDetect:
                    input->mode.pull_mode = PullMode_Up;
                    input->mode.irq_mode = IRQ_Mode_Change;
                    input->mode.debounce = On;
                    break;
#endif

                default:
                    break;
            }

            if(input->group == PinGroup_AuxInput) {
                if(input->cap.irq_mode != IRQ_Mode_None) {
                    // Map interrupt to pin
                    uint32_t extireg = SYSCFG->EXTICR[input->pin >> 2] & ~(0b1111 << ((input->pin & 0b11) << 2));
                    extireg |= ((uint32_t)(GPIO_GET_INDEX(input->port)) << ((input->pin & 0b11) << 2));
                    SYSCFG->EXTICR[input->pin >> 2] = extireg;
                }
            }

            if(input->group == PinGroup_Motor_Fault)
                input->mode.inverted = bit_istrue(settings->motor_fault_invert.mask, bit(xbar_fault_pin_to_axis(input->id)));

            GPIO_Init.Pin = input->bit;
            GPIO_Init.Pull = input->mode.pull_mode == PullMode_Up ? GPIO_PULLUP : GPIO_NOPULL;

