grblHAL/STM32F4xx/Src/driver.c
    return Status_OK;
}

#endif //UF2_BOOTLOADER

static void onReportOptions (bool newopt)
{
    if(!newopt) 
        report_plugin("Bootloader Entry", "0.03");
}

#if COPROC_PASSTHRU

#include "grbl/stream_passthru.h"

void stream_passthru_enter (void)
{
    extern uint8_t _estack; /* Symbol defined in the linker script */

    uint32_t *addr = (uint32_t *)(((uint32_t)&_estack - 1) & 0xFFFFFE00);

    __disable_irq();
    *addr = 0xDEADBEAD;

//    SCB_CleanDCache();
    NVIC_SystemReset();
}

#endif // COPROC_PASSTHRU

#endif // USB_SERIAL_CDC

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: grblHAL is not yet configured (from EEPROM data), driver_setup() will be called when done

bool driver_init (void)
{
#ifdef HAS_BOOTLOADER
    extern uint8_t _FLASH_VectorTable;
    __disable_irq();
    SCB->VTOR = (uint32_t)&_FLASH_VectorTable;
    __DSB();
    __enable_irq();
#endif

#ifdef MPG_MODE_PIN

 // Drive MPG mode input pin low until setup complete

    GPIO_InitTypeDef GPIO_Init = {
        .Speed = GPIO_SPEED_FREQ_HIGH,
        .Mode = GPIO_MODE_OUTPUT_PP,
        .Pin = 1 << MPG_MODE_PIN,
        .Mode = GPIO_MODE_OUTPUT_PP
    };

    DIGITAL_OUT(MPG_MODE_PORT, MPG_MODE_PIN, 0);

    HAL_GPIO_Init(MPG_MODE_PORT, &GPIO_Init);

#endif

    uint32_t latency;
    RCC_ClkInitTypeDef clock_cfg;

    HAL_RCC_GetClockConfig(&clock_cfg, &latency);

#ifdef STM32F446xx
    hal.info = "STM32F446";
#elif defined(STM32F429xx)
    hal.info = "STM32F429";
#elif defined(STM32F412Vx)
    hal.info = "STM32F412";
#elif defined(STM32F411xE)
    hal.info = "STM32F411";
#elif defined(STM32F407xx)
    hal.info = "STM32F407";
#else
    hal.info = "STM32F401";
#endif
    hal.driver_version = "260222";
    hal.driver_url = GRBL_URL "/STM32F4xx";
#ifdef BOARD_NAME
    hal.board = BOARD_NAME;
#endif
#ifdef BOARD_URL
    hal.board_url = BOARD_URL;
#endif
    hal.driver_setup = driver_setup;
    hal.f_mcu = HAL_RCC_GetHCLKFreq() / 1000000UL;
    hal.f_step_timer = HAL_RCC_GetPCLK1Freq() * 2 / STEPPER_TIMER_DIV;
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.get_free_mem = get_free_mem;
    hal.delay_ms = &driver_delay;

    hal.timer.claim = timerClaim;
    hal.timer.configure = timerCfg;
    hal.timer.start = timerStart;
    hal.timer.stop = timerStop;

    hal.settings_changed = settings_changed;

    cycles2us_factor = 0xFFFFFFFFU / hal.f_mcu;

    hal.stepper.wake_up = stepperWakeUp;
    hal.stepper.go_idle = stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = stepperCyclesPerTick;
    hal.stepper.pulse_start = stepperPulseStart;
    hal.stepper.motor_iterator = motor_iterator;
#ifdef GANGING_ENABLED
    hal.stepper.get_ganged = getGangedAxes;
#endif
#ifdef SQUARING_ENABLED
    hal.stepper.disable_motors = StepperDisableMotors;
#endif

    hal.limits.enable = limitsEnable;
    hal.limits.get_state = limitsGetState;
#if HOME_MASK
    hal.homing.get_state = homeGetState;
#endif

    hal.coolant.set_state = coolantSetState;
    hal.coolant.get_state = coolantGetState;

    hal.control.get_state = systemGetState;

    hal.reboot = NVIC_SystemReset;
    hal.irq_enable = __enable_irq;
    hal.irq_disable = __disable_irq;
#if I2C_STROBE_ENABLE || defined(SPI_IRQ_PIN)
    hal.irq_claim = irq_claim;
#endif
    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;
    hal.get_micros = getElapsedMicros;
    hal.get_elapsed_ticks = getElapsedTicks;
    hal.enumerate_pins = enumeratePins;
    hal.periph_port.register_pin = registerPeriphPin;
    hal.periph_port.set_pin_description = setPeriphPinDescription;

#if RTC_ENABLE

    RCC_OscInitTypeDef OscInitStruct;

    HAL_RCC_GetOscConfig(&OscInitStruct);

    if(OscInitStruct.LSIState || OscInitStruct.LSEState) {

        RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {
            .PeriphClockSelection = RCC_PERIPHCLK_RTC,
            .RTCClockSelection = OscInitStruct.LSEState ? RCC_RTCCLKSOURCE_LSE : RCC_RTCCLKSOURCE_LSI
        };

        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) == HAL_OK) {

            __HAL_RCC_RTC_ENABLE();

            if((hal.driver_cap.rtc = HAL_RTC_Init(&hrtc) == HAL_OK)) {

                struct tm time;

                hal.driver_cap.rtc_set = On;
                hal.rtc.get_datetime = get_rtc_time;
                hal.rtc.set_datetime = set_rtc_time;

                if((hal.driver_cap.rtc_set = get_rtc_time(&time)))
                    hal.driver_cap.rtc_set = ((time.tm_year + 1900) * 10000 + (time.tm_mon + 1) * 100 + time.tm_mday) >= GRBL_BUILD;
            }
        }
    }

#endif

    serialRegisterStreams();

#if USB_SERIAL_CDC

    static const sys_command_t boot_command_list[] = {
        {"DFU", enter_dfu, { .allow_blocking = On, .noargs = On }, { .str = "enter DFU bootloader" } },
  #ifdef UF2_BOOTLOADER
        {"UF2", enter_uf2, { .allow_blocking = On, .noargs = On }, { .str = "enter UF2 bootloader" } }
  #endif
    };

    static sys_commands_t boot_commands = {
        .n_commands = sizeof(boot_command_list) / sizeof(sys_command_t),
        .commands = boot_command_list
    };

    grbl.on_report_options = onReportOptions;

    stream_connect(usbInit());
    system_register_commands(&boot_commands);

  #if COPROC_PASSTHRU

    extern uint8_t _estack; /* Symbol defined in the linker script */

    bool enterpt;
    uint32_t *addr = (uint32_t *)(((uint32_t)&_estack - 1) & 0xFFFFFE00);

    if((enterpt = *addr == 0xDEADBEAD)) {
        *addr = 0x0;
        // Reduce USB IRQ priority to lower than the UART port!
        HAL_NVIC_DisableIRQ(OTG_HS_IRQn);
        HAL_NVIC_SetPriority(OTG_HS_IRQn, 1, 0);
        HAL_NVIC_EnableIRQ(OTG_HS_IRQn);
    }

    stream_passthru_init(COPROC_STREAM, 115200, enterpt);

  #endif // COPROC_PASSTHRU

#else
    if(!stream_connect_instance(SERIAL_STREAM, BAUD_RATE))
        while(true); // Cannot boot if no communication channel is available!
#endif

#if EEPROM_ENABLE
    if(!i2c_eeprom_init())
        task_run_on_startup(task_raise_alarm, (void *)Alarm_NVS_Failed);
#elif FLASH_ENABLE
    hal.nvs.type = NVS_Flash;
    hal.nvs.size_max = 1024 * 16;
    hal.nvs.memcpy_from_flash = memcpy_from_flash;
    hal.nvs.memcpy_to_flash = memcpy_to_flash;
#else
    hal.nvs.type = NVS_None;
#endif

#if LED_RGB
    hal.rgb0.out = rgb_out;
    hal.rgb0.out_masked = rgb_out_masked;
    hal.rgb0.num_devices = 1;
  #ifdef LED_W_PIN
    hal.rgb0.cap = (rgb_color_t){ .R = 1, .G = 1, .B = 1, .W = 1 };
  #else
    hal.rgb0.cap = (rgb_color_t){ .R = 1, .G = 1, .B = 1 };
  #endif
#endif

// driver capabilities, used for announcing and negotiating (with the core) driver functionality

    hal.limits_cap = get_limits_cap();
    hal.home_cap = get_home_cap();
    hal.motor_fault_cap = get_motor_fault_cap();
#if SPINDLE_ENCODER_ENABLE
    hal.driver_cap.spindle_encoder = On;
#endif
    hal.coolant_cap.bits = COOLANT_ENABLE;
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;

    static pin_group_pins_t aux_digital_in = {0}, aux_digital_out = {0},
                            aux_analog_in = {0}, aux_analog_out = {0};

    uint32_t i;
    input_signal_t *input;

    aux_assign_irq();

