grblHAL/STM32F4xx/Src/driver.c
    for(i = 0; i < sizeof(inputpin) / sizeof(input_signal_t); i++) {

        input = &inputpin[i];
        input->mode.input = input->cap.input = On;
        input->bit = 1 << input->pin;

        switch(input->group) {

            case PinGroup_AuxInput:
                if(aux_digital_in.pins.inputs == NULL)
                    aux_digital_in.pins.inputs = input;

                aux_digital_in.n_pins++;

                if(!(input->id >= Input_Aux0 && input->id <= Input_AuxMax)) {
                    input->id = Input_Aux0 + input->user_port;
                    aux_ctrl_remap_explicit((aux_gpio_t){ .port = input->port, .pin = input->pin }, input->user_port, input);
                }

                if((input->cap.debounce = input->cap.irq_mode != IRQ_Mode_None)) {
                    aux_irq |= input->bit;
                    pin_irq[__builtin_ffs(input->bit) - 1] = input;
                }
                break;

            case PinGroup_AuxInputAnalog:
                if(aux_analog_in.pins.inputs == NULL)
                    aux_analog_in.pins.inputs = input;
                input->id = (pin_function_t)(Input_Analog_Aux0 + aux_analog_in.n_pins++);
                input->mode.analog = input->cap.analog = On;
                break;

            case PinGroup_Limit:
            case PinGroup_LimitMax:
                if(limit_inputs.pins.inputs == NULL)
                    limit_inputs.pins.inputs = input;
                if(LIMIT_MASK & input->bit)
                    pin_irq[__builtin_ffs(input->bit) - 1] = input;
#ifdef Z_LIMIT_POLL
                if(input->id == Input_LimitZ)
                    z_limit_pin = input;
#endif
                limit_inputs.n_pins++;
                break;

            case PinGroup_Motor_Fault:
                if(motor_fault_inputs.pins.inputs == NULL)
                    motor_fault_inputs.pins.inputs = input;
                motor_fault_inputs.n_pins++;
                break;

            case PinGroup_SdCard:
                if(input->bit & DEVICES_IRQ_MASK)
                    pin_irq[__builtin_ffs(input->bit) - 1] = input;
                break;

            default: break;
        }
    }

    output_signal_t *output;

    for(i = 0; i < sizeof(outputpin) / sizeof(output_signal_t); i++) {

        output = &outputpin[i];
        output->mode.output = On;

        switch(output->group) {

            case PinGroup_AuxOutput:
                if(aux_digital_out.pins.outputs == NULL)
                    aux_digital_out.pins.outputs = output;
                output->id = (pin_function_t)(Output_Aux0 + aux_digital_out.n_pins);
                aux_out_remap_explicit((aux_gpio_t){ .port = output->port, .pin = output->pin }, aux_digital_out.n_pins, output);
                aux_digital_out.n_pins++;
                break;

            case PinGroup_AuxOutputAnalog:
                if(aux_analog_out.pins.outputs == NULL)
                    aux_analog_out.pins.outputs = output;
                output->mode.analog = On;
                output->id = (pin_function_t)(Output_Analog_Aux0 + aux_analog_out.n_pins++);
                break;

            default: break;
        }
    }

    if(aux_digital_in.n_pins || aux_digital_out.n_pins)
        ioports_init(&aux_digital_in, &aux_digital_out);

    if(aux_analog_in.n_pins || aux_analog_out.n_pins)
        ioports_init_analog(&aux_analog_in, &aux_analog_out);

    io_expanders_init();
    aux_ctrl_claim_ports(aux_claim_explicit, NULL);

    extern bool aux_out_claim_explicit (aux_ctrl_out_t *aux_ctrl);
    aux_ctrl_claim_out_ports(aux_out_claim_explicit, NULL);

#if DRIVER_SPINDLE_ENABLE || DRIVER_SPINDLE1_ENABLE
    extern void driver_spindles_init (void);
    driver_spindles_init();
#endif

#if STEP_INJECT_ENABLE
    if((step_pulse.inject.timer = hal.timer.claim((timer_cap_t){ .periodic = Off }, 100))) {
        hal.stepper.output_step = stepperOutputStep;
        hal.stepper.claim_motor = stepperClaimMotor;
    }
#endif

#if TRINAMIC_SPI_ENABLE
    extern void tmc_spi_init (void);
    tmc_spi_init();
#elif TRINAMIC_UART_ENABLE
    extern void tmc_uart_init (void);
    tmc_uart_init();
#endif

#ifdef QEI_PORT
    driver_encoders_init();
#endif

#ifdef HAS_BOARD_INIT
    board_init();
#endif

#if ETHERNET_ENABLE
    enet_init();
#endif

#if defined(NEOPIXEL_SPI)
    extern void neopixel_spi_init (void);
    neopixel_init();
#endif

#if defined(LED_PWM_PORT) || defined(LED1_PWM_PORT)
    extern void neopixel_pwm_init (void);
    neopixel_pwm_init();
#endif

#if defined(LED_GPO_PORT) || defined(LED1_GPO_PORT)
    extern void neopixel_gpo_init (void);
    neopixel_gpo_init();
#endif

#include "grbl/plugins_init.h"

#if MPG_ENABLE == 1
    if(!hal.driver_cap.mpg_mode)
        hal.driver_cap.mpg_mode = stream_mpg_register(stream_open_instance(MPG_STREAM, 115200, NULL, NULL), false, NULL);
    if(hal.driver_cap.mpg_mode)
        task_run_on_startup(mpg_enable, NULL);
#elif MPG_ENABLE == 2
    if(!hal.driver_cap.mpg_mode)
        hal.driver_cap.mpg_mode = stream_mpg_register(stream_open_instance(MPG_STREAM, 115200, NULL, NULL), false, stream_mpg_check_enable);
#endif

    // No need to move version check before init.
    // Compiler will fail any signature mismatch for existing entries.
    return hal.version == 10;
}

pin_group_pins_t *get_motor_fault_inputs (void)
{
    return motor_fault_inputs.n_pins ? &motor_fault_inputs : NULL;
}

/* interrupt handlers */

// Main stepper driver
ISR_CODE void STEPPER_TIMER_IRQHandler (void)
{
//    DIGITAL_OUT(AUXOUTPUT9_PORT, AUXOUTPUT9_PIN, 1);

    // Delayed step pulse handler
    if((STEPPER_TIMER->SR & STEPPER_TIMER->DIER) & TIM_SR_CC2IF) {

        STEPPER_TIMER->DIER &= ~TIM_DIER_CC2IE;

        _stepper_step_out(step_pulse.out);
    }
    // Step pulse off handler
    else if((STEPPER_TIMER->SR & STEPPER_TIMER->DIER) & TIM_SR_CC1IF) {

        STEPPER_TIMER->DIER &= ~TIM_DIER_CC1IE;

        stepper_step_out((axes_signals_t){0});

        if((STEPPER_TIMER->SR & TIM_SR_UIF) || STEPPER_TIMER->CNT < step_pulse.t_off_min) {
            STEPPER_TIMER->CNT = step_pulse.t_off_min;
            NVIC_ClearPendingIRQ(STEPPER_TIMER_IRQn);
        }

        STEPPER_TIMER->SR &= ~TIM_SR_CC1IF;
    }
    // Stepper timeout handler
    else if(STEPPER_TIMER->SR & TIM_SR_UIF) {
        STEPPER_TIMER->SR = 0;
        hal.stepper.interrupt_callback();
    }

//    DIGITAL_OUT(AUXOUTPUT9_PORT, AUXOUTPUT9_PIN, 0);
}

void core_pin_debounce (void *pin)
{
    input_signal_t *input = (input_signal_t *)pin;

    if(input->mode.irq_mode == IRQ_Mode_Change ||
         DIGITAL_IN(input->port, input->pin) == (input->mode.irq_mode == IRQ_Mode_Falling ? 0 : 1)) {

        if(input->group & PinGroup_Control) {
            hal.control.interrupt_callback(systemGetState());
        }
        if(input->group & (PinGroup_Limit|PinGroup_LimitMax)) {
            limit_signals_t state = limitsGetState();
            if(limit_signals_merge(state).value) // TODO: add check for limit switches having same state as when limit_isr were invoked?
                hal.limits.interrupt_callback(state);
        }
#if SDCARD_ENABLE && defined(SD_DETECT_PIN)
        if(input->group & PinGroup_SdCard)
            sdcard_detect(!DIGITAL_IN(SD_DETECT_PORT, SD_DETECT_PIN)); // TODO: add check for having same state as when isr were invoked?
#endif
    }

#ifdef Z_LIMIT_POLL
    if(input != z_limit_pin)
#endif
    EXTI->IMR |= input->bit; // Reenable pin interrupt
}

static inline void core_pin_irq (uint32_t bit)
{
    input_signal_t *input;

    if((input = pin_irq[__builtin_ffs(bit) - 1])) {
        if(input->mode.debounce && task_add_delayed(core_pin_debounce, input, 40)) {
            EXTI->IMR &= ~input->bit; // Disable pin interrupt
        } else
            core_pin_debounce(input);
    }
}

